const discord = require("discord.js");

module.exports.run = async (client, message, args) => {

    const channel = "841335438459011162";
    const vinkje = "✅";

    const rol = message.guild.roles.cache.find(role => role.name === "👤・Bezoeker");

    const botEmbed = new discord.MessageEmbed()
        .setTitle("**Waar kan ik Bosr vinden op social media?**")
        .setDescription(`Wij zijn te vinden op de volgende social media:

        > ・<:Bosr_logo_wit:841578775010344970>・ [Website](https://www.bosr.nl/)
        > 
        > ・<:Facebook_logo:841580615123075092>・ [Facebook](https://www.facebook.com/Bosr.nl) 
        > 
        > ・<:Instagram_logo:841580615156367380>・ [Instagram](https://www.instagram.com/bosr.nl/)
        > 
        > ・<:Tiktok_logo:841580615329382400>・ [Tiktok](https://www.tiktok.com/@bosr.nl?lang=nl-NL)
        > 
        > ・<:Twitter_logo:841580615203815475>・ [Twitter](https://www.tiktok.com/@bosr.nl?lang=nl-NL)
        > 
        > ・<:Discord_logo:841581452003901441>・ [Discord](https://dsc.gg/bosr)
        ‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ 
        `)
        .setColor("#0d0041")
        .setFooter(`Druk op het  ✅  hier beneden om toegang te krijgen tot de server.‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‎`)

    var botMessage = await message.channel.send(botEmbed);
    botMessage.react(vinkje);

    client.on("messageReactionAdd", async(reaction, user) => {
        if (user.bot) return;

        if (reaction.message.channel.id === channel) {
            if (reaction.emoji.name == vinkje) {
                await reaction.message.guild.members.cache.get(user.id).roles.add(rol);
            } else {
                return;
            }
        }
    })
}

module.exports.help = {
    name: "regels2"
}